Examinator/src/InformationRegisters/РасписаниеОбученияСУО/РасписаниеОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РасписаниеОбученияСУО</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекущиеБаллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Актуально</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПрохожденияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПроцессаОбучения</name>
    <type>
      <types>EnumRef.СтатусыПроцессаОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПроведения</name>
    <type>
      <types>EnumRef.СтатусыПроведенияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыМероприятийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаОценки</name>
    <type>
      <types>CatalogRef.ШкалыОценокСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>МероприятиеСОднимЭлектроннымЗаданием</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>НаОсновеЭлектронногоРесурса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКонтроля</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветНаКалендаре</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ОткрытоеОбучениеСУО/ОткрытоеОбучениеСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОткрытоеОбучениеСУО</name>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытоДляРуководителей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытияЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяЗаявка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыМероприятийСУО</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/РасписаниеПреподавателейСУО/РасписаниеПреподавателейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РасписаниеПреподавателейСУО</name>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>ДатаНачалаПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Проведено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыМероприятийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеПроведение</name>
    <type>
      <types>DocumentRef.ПроведениеПреподавателемОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>НаОсновеЭлектронногоРесурса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветНаКалендаре</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиПреподавателейСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/БазовыйРолиПользователейСУО/БазовыйРолиПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>БазовыйРолиПользователейСУО</name>
  <enumValues>
    <name>Учащийся</name>
  </enumValues>
  <enumValues>
    <name>Преподаватель</name>
  </enumValues>
  <enumValues>
    <name>Менеджер</name>
  </enumValues>
  <enumValues>
    <name>ВнешнийПользователь</name>
  </enumValues>
  <enumValues>
    <name>Руководитель</name>
  </enumValues>
  <enumValues>
    <name>Разработчик</name>
  </enumValues>
  <enumValues>
    <name>Администратор</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/СтатусыЗаявокНаОбучениеСУО/СтатусыЗаявокНаОбучениеСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявокНаОбучениеСУО</name>
  <enumValues>
    <name>НаРассмотрении</name>
  </enumValues>
  <enumValues>
    <name>Утверждена</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Documents/ПрохождениеОбученияСУО/ПрохождениеОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрохождениеОбученияСУО</name>
  <registerRecords>InformationRegister.РасписаниеОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.ФайлыНаПроверкуПреподавателюСУО</registerRecords>
  <registerRecords>InformationRegister.УчастникиОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.ОценкиКачестваОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.БиблиотекаПользователейСУО</registerRecords>
  <registerRecords>InformationRegister.ПрохожденияОбученияСУО</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеПрохождение</name>
    <type>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущиеБаллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПрохожденияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаОбучениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <comment>Только для электронного обучения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <comment>Только для электронного обучения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвращеноНаДоработку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленоВремениВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленоВремениСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаКачестваОбучения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКачестваОбучения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОцениванияКачестваОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставленаОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Documents/ПроведениеПреподавателемОбученияСУО/ПроведениеПреподавателемОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроведениеПреподавателемОбученияСУО</name>
  <registerRecords>InformationRegister.ПроведениеПреподавателямиОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.РасписаниеПреподавателейСУО</registerRecords>
  <registerRecords>InformationRegister.ПреподавателиОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.БиблиотекаПользователейСУО</registerRecords>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеПроведение</name>
    <type>
      <types>DocumentRef.ПроведениеПреподавателемОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Проведено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиПреподавателейСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьОтУченика</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоПросмотрВедомости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

Examinator/src/CommonForms/МоеОбучениеСУО/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьЛичныйКабинетСУО") Тогда
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		Возврат;
	КонецЕсли;
		
	// Заполняем переменные
	
	Пользователь = ?(ЗначениеЗаполнено(Параметры.Пользователь), Параметры.Пользователь, Пользователи.ТекущийПользователь());
	
	ЗаполнитьТаблицуОбучения();
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьМоеОбучение"
		ИЛИ ИмяСобытия = "ОбновитьПрохождениеОбучения" Тогда
		ЗаполнитьТаблицуОбучения();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМоеОбучение

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ МоеОбучение

&НаКлиенте
Процедура МоеОбучениеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = МоеОбучение.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Если ТекущаяСтрока.Команда = "activity" ИЛИ ТекущаяСтрока.Команда = "teacherActivity" Тогда
		ОбучениеСУОКлиент.ОткрытьОбучение(ТекущаяСтрока.Ссылка);
	КонецЕсли;	
	
	Если ТекущаяСтрока.Команда = "application" Тогда
		ОбучениеСУОКлиент.ОткрытьЗаявку(ТекущаяСтрока.Ссылка, Пользователь);	
	КонецЕсли;
	
	Если ТекущаяСтрока.Команда = "free" Тогда		
		ОткрытьФорму("ОбщаяФорма.ЗаписьНаОбучениеСУО", Новый Структура("ПредметЗаписи", ТекущаяСтрока.Ссылка), ЭтаФорма);
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОбновитьМоеОбучение(Команда)
	ЗаполнитьТаблицуОбучения();
КонецПроцедуры

&НаКлиенте
Процедура МоиРезультаты(Команда)
	ОткрытьФорму("ОбщаяФорма.МоиРезультатыСУО");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗаполнитьТаблицуОбучения()
	
	ЭтоПолныйИнтерфейс = ПолучитьФункциональнуюОпцию("ПолныйИнтерфейсСУО");

	// Очищаем таблицу
	
	МоеОбучение.Очистить();
	
	// Заполняем таблицу обучения
	
	РолиПользователя = ОбучениеСУОПовтИсп.СписокБазовыхПравПользователя(Пользователь);
	МассивЦветов = Новый Массив;
	ТекущаяДата = ТекущаяДатаСеанса();	
	
	Для каждого РольПользователя Из РолиПользователя Цикл
	
		Если РольПользователя = Перечисления.БазовыйРолиПользователейСУО.Учащийся Тогда
			
			ВыборкаДетальныеЗаписи = РегистрыСведений.РасписаниеОбученияСУО.ВыбратьЭлементыРасписания(Пользователь);
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				ОписаниеПрохождения = Документы.ПрохождениеОбученияСУО.УчебнаяАктивностьСтруктура(ВыборкаДетальныеЗаписи.ПрохождениеОбучения);
				
				НоваяСтрока = МоеОбучение.Добавить();
				НоваяСтрока.Ссылка = ВыборкаДетальныеЗаписи.ПрохождениеОбучения;
				НоваяСтрока.Представление = ОписаниеПрохождения.Наименование;
				НоваяСтрока.Цвет = ?(ЗначениеЗаполнено(ОписаниеПрохождения.Цвет), ОписаниеПрохождения.Цвет, "3366cc");
				НоваяСтрока.Картинка = 0;
				НоваяСтрока.Команда = "activity";
				НоваяСтрока.ЦветовойМаркер = "";
				НоваяСтрока.Описание = ОписаниеПрохождения.КомментарийДляУчастника;
				НоваяСтрока.ДатаНачалаЧисло = ОписаниеПрохождения.ДатаНачала;
				НоваяСтрока.ДатаОкончанияЧисло = ОписаниеПрохождения.ДатаОкончания;
				
				Если ОписаниеПрохождения.ВариантПродолжительности = 3
					ИЛИ ОписаниеПрохождения.ВариантПродолжительности = 4 Тогда
					
					НоваяСтрока.ПериодСтрока = Документы.ПрохождениеОбученияСУО.ОсталосьВремениСтрока(
						ОписаниеПрохождения.Актуально,
						Перечисления.СтатусыПроцессаОбученияСУО.ЧислоВЗначение(ОписаниеПрохождения.СтатусОбучения),
						Перечисления.ПродолжительностьОбученияСУО.ЧислоВЗначение(ОписаниеПрохождения.ВариантПродолжительности),
						ОписаниеПрохождения.ПродолжительностьВСекундах,
						ОбщегоНазначенияСУКлиентСервер.ЧислоВДату(ОписаниеПрохождения.ДатаНачалаОтсчетаПродолжительности),
						Перечисления.ПродолжительностьОбученияСУО.ЧислоВЗначение(ОписаниеПрохождения.ДатаОкончания));
										
				Иначе
					
					НоваяСтрока.ПериодСтрока = ОбщегоНазначенияСУКлиентСервер.ПериодВСтроку(ОписаниеПрохождения.ДатаНачала, ОписаниеПрохождения.ДатаОкончания, ОписаниеПрохождения.СкрытьВремяПроведения);
					
				КонецЕсли;
				
				НоваяСтрока.Статус = Перечисления.СтатусыПроцессаОбученияСУО.ЧислоВПредставление(ОписаниеПрохождения.СтатусОбучения);
				
				Если МассивЦветов.Найти(НоваяСтрока.Цвет) = Неопределено Тогда
					МассивЦветов.Добавить(НоваяСтрока.Цвет);	
				КонецЕсли;
				
			КонецЦикла;
			
			ВыборкаДетальныеЗаписи = РегистрыСведений.ОткрытоеОбучениеСУО.ВыбратьЭлементыРасписания(,Пользователь);
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПрохождениеОбучения) Тогда
					
					Продолжить; // Уже зачислен
					
				КонецЕсли;				
				
				Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаОткрытияЗаписи)
					И ТекущаяДата < ВыборкаДетальныеЗаписи.ДатаОткрытияЗаписи Тогда
					
					Продолжить; // Запись еще не началась
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаЗакрытияЗаписи)
					И ТекущаяДата > ВыборкаДетальныеЗаписи.ДатаЗакрытияЗаписи Тогда
					
					Продолжить; // Запись закончилась
					
				КонецЕсли;				
				
				Если ТипЗнч(ВыборкаДетальныеЗаписи.ДатаЗаявки) = Тип("Дата")
					И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаЗаявки)
					И (ВыборкаДетальныеЗаписи.СтатусЗаявки = Перечисления.СтатусыЗаявокНаОбучениеСУО.Отклонена
					ИЛИ ВыборкаДетальныеЗаписи.СтатусЗаявки = Перечисления.СтатусыЗаявокНаОбучениеСУО.Отменена)
					И ДобавитьМесяц(ВыборкаДетальныеЗаписи.ДатаЗаявки, 1) < ТекущаяДатаСеанса() Тогда
					
					Продолжить; // Старые отклоненные и отмененные заявки не показываем
					
				КонецЕсли;
				
				НоваяСтрока = МоеОбучение.Добавить();
				НоваяСтрока.Ссылка = ВыборкаДетальныеЗаписи.ПроведениеОбучения;
				НоваяСтрока.Представление = ВыборкаДетальныеЗаписи.Наименование;
				НоваяСтрока.Цвет = "cccccc";
				НоваяСтрока.Картинка = 0;
				НоваяСтрока.Команда = ?(ВыборкаДетальныеЗаписи.ТребуетсяЗаявка, "application", "free");
				НоваяСтрока.ЦветовойМаркер = "";
				НоваяСтрока.Описание = "";
				НоваяСтрока.ДатаНачалаЧисло = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(ВыборкаДетальныеЗаписи.ДатаНачалаПроведения);
				НоваяСтрока.ДатаОкончанияЧисло = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(ВыборкаДетальныеЗаписи.ДатаОкончанияПроведения);
				НоваяСтрока.ПериодСтрока = ОбщегоНазначенияСУКлиентСервер.ПериодВСтроку(НоваяСтрока.ДатаНачалаЧисло, НоваяСтрока.ДатаОкончанияЧисло, ВыборкаДетальныеЗаписи.СкрытьВремяПроведения);
				
				Если ВыборкаДетальныеЗаписи.ТребуетсяЗаявка Тогда
					НоваяСтрока.Статус = НСтр("ru = 'Открыто для подачи заявки'");
					Если ВыборкаДетальныеЗаписи.СтатусЗаявки = Перечисления.СтатусыЗаявокНаОбучениеСУО.НаРассмотрении Тогда
						НоваяСтрока.Статус = НСтр("ru = 'Заявка рассматривается'");
					КонецЕсли;
					Если ВыборкаДетальныеЗаписи.СтатусЗаявки = Перечисления.СтатусыЗаявокНаОбучениеСУО.Утверждена Тогда
						НоваяСтрока.Статус = НСтр("ru = 'Заявка утверждена'");
					КонецЕсли;
					Если ВыборкаДетальныеЗаписи.СтатусЗаявки = Перечисления.СтатусыЗаявокНаОбучениеСУО.Отклонена Тогда
						НоваяСтрока.Статус = НСтр("ru = 'Заявка отклонена'");
						НоваяСтрока.ВыделитьСтатус = Истина;
					КонецЕсли;
					Если ВыборкаДетальныеЗаписи.СтатусЗаявки = Перечисления.СтатусыЗаявокНаОбучениеСУО.Отменена Тогда
						НоваяСтрока.Статус = НСтр("ru = 'Заявка отменена и может быть подана повторно'");
						НоваяСтрока.ВыделитьСтатус = Истина;
					КонецЕсли;
				Иначе
					НоваяСтрока.Статус = НСтр("ru = 'Открыто для записи'");
				КонецЕсли;				
				
				Если МассивЦветов.Найти(НоваяСтрока.Цвет) = Неопределено Тогда
					МассивЦветов.Добавить(НоваяСтрока.Цвет);	
				КонецЕсли;
				
			КонецЦикла;
			
			
		КонецЕсли;
		
		Если РольПользователя = Перечисления.БазовыйРолиПользователейСУО.Преподаватель Тогда
			
			ВыборкаДетальныеЗаписи = РегистрыСведений.РасписаниеПреподавателейСУО.ВыбратьЭлементыРасписания(Пользователь);
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				ОписаниеПрохождения = Документы.ПроведениеПреподавателемОбученияСУО.ПреподавательскаяАктивностьСтруктура(ВыборкаДетальныеЗаписи.ПроведениеОбученияПреподавателем);
				
				НоваяСтрока = МоеОбучение.Добавить();
				НоваяСтрока.Ссылка = ВыборкаДетальныеЗаписи.ПроведениеОбученияПреподавателем;
				НоваяСтрока.Представление = ОписаниеПрохождения.Наименование;
				НоваяСтрока.Цвет = ?(ЗначениеЗаполнено(ОписаниеПрохождения.Цвет), ОписаниеПрохождения.Цвет, "2fb62f");
				НоваяСтрока.Картинка = 1;
				НоваяСтрока.Команда = "teacherActivity";
				НоваяСтрока.ЦветовойМаркер = "";
				НоваяСтрока.Описание = ОписаниеПрохождения.КомментарийДляПреподавателя;
				НоваяСтрока.ДатаНачалаЧисло = ОписаниеПрохождения.ДатаНачала;
				НоваяСтрока.ДатаОкончанияЧисло = ОписаниеПрохождения.ДатаОкончания;
				НоваяСтрока.ПериодСтрока = ОбщегоНазначенияСУКлиентСервер.ПериодВСтроку(ОписаниеПрохождения.ДатаНачала, ОписаниеПрохождения.ДатаОкончания, ОписаниеПрохождения.СкрытьВремяПроведения);  
				НоваяСтрока.Статус = Перечисления.СтатусыПроцессаПреподаванияСУО.ЧислоВПредставление(ОписаниеПрохождения.СтатусПреподавания);
				
				Если МассивЦветов.Найти(НоваяСтрока.Цвет) = Неопределено Тогда
					МассивЦветов.Добавить(НоваяСтрока.Цвет);	
				КонецЕсли;
				
			КонецЦикла;
			
			
		КонецЕсли;
			
	КонецЦикла;
	
	МоеОбучение.Сортировать("ДатаНачалаЧисло Убыв, Команда Возр");
	
	Если МассивЦветов.Количество() > 1 И ЭтоПолныйИнтерфейс И МоеОбучение.Количество() > 10 Тогда
		
		Элементы.МоеОбучениеЦветовойМаркер.Видимость = Истина;
		
		// Заполняем цветовые маркеры
		
		Для каждого ЦветМаркера Из МассивЦветов Цикл
		
			НовоеОформление = УсловноеОформление.Элементы.Добавить();
		
			НовоеОформление.Использование = Истина;
			НовоеОформление.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный; 
			НовоеОформление.ПредставлениеПользовательскойНастройки = "Цветовой маркер """ + ЦветМаркера +""""; 
			
			Отбор = НовоеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Отбор.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("МоеОбучение.Цвет");
			Отбор.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
			Отбор.Использование    = Истина;
			Отбор.Представление    = "МоеОбучение.Цвет";
			Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
			Отбор.ПравоеЗначение   = ЦветМаркера;
			
			
			ЭлементОформленияЦветФона = НовоеОформление.Оформление.Элементы.Найти("ЦветФона");
			ЭлементОформленияЦветФона.Значение      = ОбщегоНазначенияСУКлиентСервер.ВебЦветВОбъект(ЦветМаркера);
			ЭлементОформленияЦветФона.Использование = Истина;
			
			// Устанавливаем поле для оформления
			
			ПолеОформления = НовоеОформление.Поля.Элементы.Добавить();
			ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("МоеОбучениеЦветовойМаркер"); 
		
		КонецЦикла;
		
	Иначе
		
		Элементы.МоеОбучениеЦветовойМаркер.Видимость = Ложь;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
